## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_hub_connection.spoke_aks_vhub will be created
  + resource "azurerm_virtual_hub_connection" "spoke_aks_vhub" {
      + id                        = (known after apply)
      + internet_security_enabled = false
      + name                      = "spoke-aks-vhub"
      + remote_virtual_network_id = (known after apply)
      + virtual_hub_id            = "/subscriptions/3124b81f-32b6-49f2-98d6-7500ef2a165f/resourceGroups/accern-nwsvcs-prd-eus2-rg/providers/Microsoft.Network/virtualHubs/acn-virtual-hub-prd"

      + routing (known after apply)
    }

  # module.vnet_spoke_aks.azurerm_subnet.subnet["aks_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.16.1.128/25",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acn-spoke-aks-snet-aks"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "acn-spoke-aks-vnet"
    }

  # module.vnet_spoke_aks.azurerm_subnet.subnet["appgw_snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.16.1.0/25",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acn-spoke-aks-snet-appgw"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = (known after apply)
      + virtual_network_name                           = "acn-spoke-aks-vnet"
    }

  # module.vnet_spoke_aks.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "172.16.1.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "acn-spoke-aks-vnet"
      + resource_group_name = "accern-nwsvcs-prd-eus2-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Application" = "accern-aks"
          + "Environment" = "prod"
          + "ID"          = "00000001"
          + "Owner"       = "Javier.Gaibisso"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>